module.exports = {
  // Максимальная длина строки
  printWidth: 100,

  // Количество пробелов на один отступ
  tabWidth: 2,

  // Используем пробелы вместо табов
  useTabs: false,

  // Всегда ставим точку с запятой
  semi: true,

  // Всегда используем одинарные кавычки, кроме случаев, когда нужно экранировать
  singleQuote: true,

  // Всегда ставим запятую в конце элементов массивов/объектов (трейлинг-комма)
  trailingComma: "all",

  // Пробел после двоеточия в объектах и типах TS
  bracketSpacing: true,

  // Форматируем стрелочные функции с одним аргументом без скобок
  arrowParens: "avoid",

  // Форматируем JSX красиво
  jsxSingleQuote: true,
  jsxBracketSameLine: false,

  // Минимальная ширина для строковых литералов
  proseWrap: "always",
};
