const metroColors = {
  "Таганско-Краснопресненская": "#8A4298",
  Кольцевая: "#905C4E",
  Замоскворецкая: "#49B663",
  "Люблинско-Дмитровская": "#AEC84B",
  Некрасовская: "#F294B5",
  "Большая кольцевая линия": "#80C8C5",
  Сокольническая: "#F53342",
  "Калужско-Рижская": "#FC8A31",
  "Серпуховско-Тимирязевская": "#9F9F9F",
  "Арбатско-Покровская": "#0672B2",
  Филёвская: "#08D2FF",
  МЦК: "#D6171B",
  Калининская: "#F3E022",
  Солнцевская: "#F3E022",
  Бутовская: "#B1CBEE",
  "Курско-Рижский": "#E74182",
  "Белорусско-Савеловский": "#ED9F2D",
  "Калужско-Нижегородский": "#3CB183",
  "Московский монорельс": "rgb(33, 77, 166)",
} as const;

export const getMetroColor = (line: string): string => {
  return metroColors[line] || "#fff";
};
